---
kind: type
id: T:Autodesk.Revit.DB.Visual.HardwoodFinishType
source: html/5f62de81-1348-b07e-8e93-8a5ded0d4b45.htm
---
# Autodesk.Revit.DB.Visual.HardwoodFinishType

The enumerated type representing the permitted values for the asset property "HardwoodFinish" from the "Hardwood" schema.

## Syntax (C#)
```csharp
public enum HardwoodFinishType
```